M = {}

M.altchar = { c = 'k', k = 'c', f = 'h', h = 'f', j = 'z', z = 'j', l = 'x', x = 'l' }

M.kanalist = [[
あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん
がぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽ
っぁぃぅぇぉゃゅょ
アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン
ガギグゲゴザジズゼゾダヂヅデドバビブベボパピプペポ
ッァィゥェォャュョヮ
ｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｯｧｨｩｪｫｬｭｮ
]]

M.hankanalist = [[
ｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｯｧｨｩｪｫｬｭｮ
]]

M.kana = {
  a = 'aあぁアァｱｧ',
  b = 'bばびぶべぼバビブベボ',
  c = 'cかきくけこカキクケコｶｷｸｹｺ',
  d = 'dだぢづでどダヂヅデド',
  e = 'eえぇエェｴｪ',
  f = 'fふフﾌ',
  g = 'gがぎぐげごガギグゲゴ',
  h = 'hはひふへほハヒフヘホﾊﾋﾌﾍﾎ',
  i = 'iいぃイィｲｨ',
  j = 'jじジ',
  k = 'kかきくけこカキクケコｶｷｸｹｺ',
  l = 'lっッｯ',
  m = 'mまみむめもマミムメモﾏﾐﾑﾒﾓ',
  n = 'nなにぬねのんナニヌネノンﾅﾆﾇﾈﾉﾝ',
  o = 'oおぉオォｵｫ',
  p = 'pぱぴぷぺぽパピプペポ',
  r = 'rらりるれろラリルレロﾗﾘﾙﾚﾛ',
  s = 'sさしすせそサシスセソｻｼｽｾｿ',
  t = 'tたちつってとタチツッテトﾀﾁﾂｯﾃﾄ',
  u = 'uうぅウゥｳｩ',
  v = 'vゔヴ',
  w = 'wわゎをワヮヲｦ',
  x = 'xっッｯ',
  y = 'yやゆよヤユヨャュョﾔﾕﾖｬｭｮ',
  z = 'zざじずぜぞザジズゼゾ',
}

return M
