M = {}

M.altchar = { c = 'k', k = 'c', f = 'h', h = 'f', j = 'z', z = 'j', l = 'x', x = 'l' }

M.kanalist = [[
あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん
がぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽ
っぁぃぅぇぉゃゅょ
アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン
ガギグゲゴザジズゼゾダヂヅデドバビブベボパピプペポ
ッァィゥェォャュョ
ｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｯｧｨｩｪｫｬｭｮ
]]

M.hankanalist = [[
ｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｯｧｨｩｪｫｬｭｮ
]]

M.kana = {
  a = 'aあぁアァｱｧ',
  b = 'bばびぶべぼバビブベボ',
  c = 'cかきくけこカキクケコｶｷｸｹｺ',
  d = 'dだぢづでどダヂヅデド',
  e = 'eえぇエェｴｪ',
  f = 'fふフﾌ',
  g = 'gがぎぐげごガギグゲゴ',
  h = 'hはひふへほハヒフヘホﾊﾋﾌﾍﾎ',
  i = 'iいぃイィｲｨ',
  j = 'jじジ',
  k = 'kかきくけこカキクケコｶｷｸｹｺ',
  l = 'lっッﾂｯ',
  m = 'mまみむめもマミムメモﾏﾐﾑﾒﾓ',
  n = 'nなにぬねのんナニヌネノンﾅﾆﾇﾈﾉﾝ',
  o = 'oおぉオォｵｫ',
  p = 'pぱぴぷぺぽパピプペポ',
  r = 'rらりるれろラリルレロﾗﾘﾙﾚﾛ',
  s = 'sさしすせそサシスセソｻｼｽｾｿ',
  t = 'tたちつってとタチツッテトﾀﾁﾂﾃﾄ',
  u = 'uうぅウゥｳｩ',
  v = 'vゔヴ',
  w = 'wわゎワヮヲｦ',
  x = 'xっッﾂｯ',
  y = 'yやゆよヤユヨﾔﾕﾖｬｭｮ',
  z = 'zざじずぜぞザジズゼゾ',
}

return M
